#include "stdafx.h"
#include <iostream>
#include <cstdlib>
using namespace std;

/*

ЗАДАНИЕ П4.10 (а, б, в, г)

*/

int main()
{
	setlocale(0, "Russian");
	int x, y;

	cout << "Введите число X: ";
	cin >> x;
	cout << "Введите число Y: ";
	cin >> y;
	system("cls");
	cout << "Число X: " << x << " | Число Y: " << y << endl << endl;

	// а
	if (y >= 4 && pow(x, 2) <= 4) {
		cout << "M(" << x << ", " << y << ") для задания П4.10 (а) принадлежит  заштрихованной области" << endl;
	}
	else cout << "M(" << x << ", " << y << " ) для задания П4.10 (а) не принадлежит  заштрихованной области" << endl;
	
	// б 
	if (y >= -2 && (pow(x, 2) - 2)  <= 2) {
		cout << "M(" << x << ", " << y << ") для задания П4.10 (б) принадлежит  заштрихованной области" << endl;
	}
	else cout << "M(" << x << ", " << y << ") для задания П4.10 (б) не принадлежит  заштрихованной области" << endl;

	// в
	if (pow(2, x) >= 0 && y >= 0 && pow(x, 2) <= x) {
		cout << "M(" << x << ", " << y << ") для задания П4.10 (в) принадлежит  заштрихованной области" << endl;
	}
	else cout << "M(" << x << ", " << y << ") для задания П4.10 (в) не принадлежит  заштрихованной области" << endl;

	// г
	if (y >= -3 && (pow(x, 2) - 3) <= -x) {
		cout << "M(" << x << ", " << y << ") для задания П4.10 (г) принадлежит  заштрихованной области" << endl;
	}
	else cout << "M(" << x << ", " << y << ") для задания П4.10 (г) не принадлежит  заштрихованной области" << endl;
	
	// П4.19
	if ((pow(x, 2) + pow(y, 2)) >= 2 && (pow(x, 2) >= 0 && y <= 4))  {

	}
	else cout << "M(" << x << ", " << y << ") для задания П4.19 не принадлежит  заштрихованной области" << endl;
	system("pause");
	return 0;
}
