#include "stdafx.h"
#include <iostream>
#include <cstdlib>
using namespace std;

/*

ЗАДАНИЕ П4.9 (Б,Г)

*/

int main()
{
	setlocale(0, "Russian");
	int x, y;
	
	cout << "Введите число X...\n";
	cin >> x;
	cout << "Введите число Y...\n";
	cin >> y;

	cout << "Число X: " << x << " | Число Y: " << y << endl << endl << endl;
	
	if (x <= -2 && (pow(x, 2) + pow(y, 2)) <= 4) {
		cout << "Точка с координатами ("<< x << ", " << y << ") для задания П4.9 (Б) принадлежит заштрихованной области" << endl;
	}
	else cout << "Точка с координатами (" << x << ", " << y << ") для задания П4.9 (Б) не принадлежит заштрихованной области" << endl;

	if (y == x && (pow(x, 2) + pow(y, 2)) <= 3) {
		cout << "Точка с координатами (" << x << ", " << y << ") для задания П4.9 (г) принадлежит заштрихованной области" << endl;
	}
	else cout << "Точка с координатами (" << x << ", " << y << ") для задания П4.9 (г) не принадлежит заштрихованной области" << endl;

	system("pause");
	return 0;
}

