#include "stdafx.h"
#include <iostream>
#include <cstdlib>
using namespace std;

/*

ЗАДАНИЕ П4.25 (В,Г)

*/

int main()
{
	setlocale(0, "Russian");
	int x, y;
	
	cout << "Введите число X...\n";
	cin >> x;
	cout << "Введите число Y...\n";
	cin >> y;

	cout << "Число X: " << x << " | Число Y: " << y << endl << endl << endl;
	
	if (x >= 0 && (pow(x, 2) + pow(y, 2)) <= 1) {
		cout << "Точка с координатами ("<< x << ", " << y << ") для задания П4.8 (в) принадлежит заштрихованной области" << endl;
	}
	else cout << "Точка с координатами (" << x << ", " << y << ") для задания П4.8 (в) не принадлежит заштрихованной области" << endl;

	if (x <= 0 && (pow(x, 2) + pow(y, 2)) >= 2) {
		cout << "Точка с координатами (" << x << ", " << y << ") для задания П4.8 (г) принадлежит заштрихованной области" << endl;
	}
	else cout << "Точка с координатами (" << x << ", " << y << ") для задания П4.8 (г) не принадлежит заштрихованной области" << endl;
	
	system("pause");
	return 0;
}

